In [11]:
import pandas as pd
import numpy as np

In [12]:
instagram = pd.read_excel('instagram_data_collected.xlsx')
instagram.astype({'Comments': 'int64','Likes':'int64'})
instagram.head()

,User,#Followers,#Posts,Photo Location,Likes,Comments,Place?,People?,Hashtags
0,abcdosviajantes,10400,414,Praia De Carro Quebrado,64,27,Beach,No,None
1,abcdosviajantes,10400,414,None,45,8,Food,No,None
2,abcdosviajantes,10400,414,"Pedra Do Arpoador, Rio De Janeiro",65,34,Beach,No,None
3,abcdosviajantes,10400,414,Maceió-Alagoas/ Nordeste Do Brasil,68,17,Beach,No,None
4,abcdosviajantes,10400,414,Brasil,90,33,Nature,No,None

In [13]:
instagram['People'] = np.where(instagram['People?']=='Yes',True,False)

In [14]:
instagram['#'] = np.where(instagram['Hashtags']=='None',False,True)

In [15]:
instagram.drop(['People?','Hashtags'],axis=1,inplace=True)

In [19]:
instagram.rename(columns={"Place?": "Places"},inplace=True)

In [20]:
instagram

,User,#Followers,#Posts,Photo Location,Likes,Comments,Places,People,#
0,abcdosviajantes,10400,414,Praia De Carro Quebrado,64,27,Beach,False,False
1,abcdosviajantes,10400,414,None,45,8,Food,False,False
2,abcdosviajantes,10400,414,"Pedra Do Arpoador, Rio De Janeiro",65,34,Beach,False,False
3,abcdosviajantes,10400,414,Maceió-Alagoas/ Nordeste Do Brasil,68,17,Beach,False,False
4,abcdosviajantes,10400,414,Brasil,90,33,Nature,False,False
...,...,...,...,...,...,...,...,...,...
95,comigoporai,18600,363,"London, United Kingdom",427,72,Food,True,False
96,comigoporai,18600,363,"London, United Kingdom",546,68,Street,True,False
97,comigoporai,18600,363,Picadilly Circus,515,87,Street,True,False
98,comigoporai,18600,363,"Pergola and Hill Gardens, Hampstead Heath",590,100,Nature,True,False
99,comigoporai,18600,363,"London, United Kingdom",383,45,Culture,True,False

In [21]:
instagram.to_excel('instagram_clean.xlsx')